app/Otp/Otp.php

select * from `students` where `id` = 0 limit 1
---
	public function otp($data)
	{

		$student = Student::where('id',$data)->first();