@extends('layouts.website')
@section('content')

    <!-- Post Section Start -->
    <div class="post-section section pt-30">
        <div class="container">
            <div class="row">
                <div class="col-md-12">
               	 <div class="regimes">
                    @if(session()->has('rsuccess'))
                	<div class="alert alert-primary" role="alert">
                      আপনার আবেদন যাচাই বাছাই এর জন্য এডমিনের কাছে পাঠানো হয়েছে, আবেদন গ্রহন করা হলে আপনাকে অবগত করা হবে। দয়া করে একদিন পরে আবার চেক করবেন।
                    </div>
					@endif
                  </div>
                  <div class="howtow">
                    <h3>কিভাবে লিখবে</h3>
                    <p>প্যারিটিউর ক্লিক করে নিন্দা জানায়, টেরি রিচার্ডসনের উচ্চ জীবনের জন্য এটি উচ্চতর জীবন যাপন করতে পারে। 3 নেকড়ে চাঁদ অফিয়া আউটে, নন কাপেদ্যাটাত স্কেটবোর্ড ডলোর ব্রাঞ্চ। খাদ্য ট্রাক কুইনা নেউসিয়েন্ট শ্রম। ব্রাঞ্চ 3 নেকড়ে চাঁদ টেম্পোর, তার উপর একটি পাখি রাখুন একক-উত্স্রিত কফি নুলা আসসুমেন্ট শোরডিচ এবং। নিহিল আনিম কেফিয়েহ হেলভেটিকা, ক্রাফট বিয়ার লেবার ওয়েস অ্যান্ডারসন ক্রেডিট নেসিয়্যান্ট সাপিয়েন্টে এ প্রভিডেন্ট। বিজ্ঞাপন ভেগান বাদে কসাই ভাইস লোমো। লেগিংস অবাকেক্যাট ক্রাফট বিয়ার ফার্ম-টু-টেবিল, কাঁচা ডেনিম নান্দনিক সিন্থ নেসাইক্যান্ট আপনি সম্ভবত তাদের সম্পর্কে শ্রমসাধ্য টেকসই ভিএইচএস শুনেনি</p>
                  </div>
                </div>     
            </div><!--Row post1 End-->
        </div><!-- Container End -->
    </div><!-- Post Section End -->


@endsection



