app/Http/Controllers/AdminController.php

    public function index()
    {
        $batchIds = Batchpackage::orderBy('updated_at', 'desc')->get(['batch_id', 'title']);

        $batchArray = [];


        foreach ($batchIds as $batchId) {
            $count = BatchStudent::where('batch_id', $batchId['batch_id'])->where('enroll_status', 1)->count();
            $batchArray[] = [$batchId['batch_id'], $batchId['title'], $count];

        }

        $otp = Student::where('id', 3074)->value('otp');
---
select `batch_id`, `title` from `batchpackages` order by `updated_at` desc
select count(*) as aggregate from `batch_students` where `batch_id` = 75 and `enroll_status` = 1
select `otp` from `students` where `id` = 3074 limit 1