app/Http/Controllers/StudentController.php

    public function password_verify(Request $request, $id, $method)
    {
        $this->validate($request, [
            'password' => 'required',
        ]);

        $student = Student::where('id', $id)->first() ?? abort(404);

        if ($student->password == md5($request->password)) {
            $loginOTP = rand(1000, 9999);

            $update = Student::where('id', $student->id)->update([
                'otp' => $loginOTP,
            ]);
---
select * from `students` where `id` = '3074' limit 1

    public function otp($id, $is_login)
    {
        $student = Student::where('id', $id)->first();
---
select * from `students` where `id` = '3074' limit 1

    public function otp_verify(Request $request, $id, $is_login)
    {
        $this->validate($request, [
            'otp' => 'required',
        ]);

        $student = Student::where('id', $id)->first() ?? abort(404);

        if ($student->otp == $request->otp) {
            // Create api_token and return with login information
            $token = Str::random(60);
            $student->api_token = $token;
            $student->otp = NULL;
            $student->save();
---
update `students` set `otp` = '', `api_token` = '6omfHL1PG6SNWJc103teXSBkTnhbP9DfAxHDVCvtP6XgmcjA26J6tmOTdYws', `updated_at` = '2025-10-27 01:02:53' where `id` = 3074