app/Http/Controllers/SubscriberController.php

    public function index()
    {
        $subscribers = \App\Subscriber::orderBy('id', 'DESC')->paginate();
---
select * from `subscribers` order by `id` desc limit 3 offset 0
select count(*) as aggregate from `subscribers`