app/Http/Controllers/WebsiteController.php

select * from `students` where `status` = 1 and `id` is null limit 1
select `notice` from `notices` where `batch_id` = 'public' limit 1
select count(*) as aggregate from `batch_students` as `a` inner join `notices` as `b` on `a`.`batch_id` = `b`.`batch_id` where `a`.`student_id` = 3074 and `a`.`enroll_status` = 1 and `a`.`subscription_end` >= '2025-10-28 02:09:14'
select count(*) as aggregate from `notification_history` where `user_id` = 3074
select count(*) as aggregate from `posts` where `answer_count` = 0
---
    public function home()
    {

        $userId = Session::get('id');

        $profile = Student::where('status', 1)->where('id', $userId)->first();

        $publicNotice = DB::table('notices')->where('batch_id', 'public')->value('notice');


        if (!empty($profile)) {
            $all = DB::table('batch_students as a')
                ->join('notices as b', function ($joinOne) {
                    $joinOne->on('a.batch_id', '=', 'b.batch_id');
                })->where('a.student_id', Session::get('id'))->where('a.enroll_status', 1)->where('a.subscription_end', '>=', NOW())->count();

            $read = DB::table('notification_history')
                ->where('user_id', Session::get('id'))->count();

            $new = $all - $read;

            if ($profile->user_type = "mentor") {
                $question_count = DB::table('posts')->where('answer_count', 0)->count();

select * from `batchpackages` where `showing_status` = 1 and `title` like '%Workshop%' and `batch_category` = '2' order by `updated_at` desc
select * from `batchpackages` where `showing_status` = 1 and `batch_category` = '2' order by `updated_at` desc
---
    public function searchPage(Request $request)
    {

        $batchpackages = Batchpackage::where('showing_status', 1)->latest('updated_at')
            ->when($request->filled('search'), function ($query) use ($request) {
                $query->where('title', 'like', '%' . $request->search . '%');
            })
            ->when($request->filled('batch_category'), function ($query) use ($request) {
                $query->where('batch_category', '=',  $request->batch_category);
            });
        if ($request->filled('limit')) {
            $batchpackages = $batchpackages->limit($request->limit ?? 15);
        }
        $batchpackages = $batchpackages->get();