app/Http/Controllers/Admin/AdminController.php

select `value` from `business_settings` where `type` = 'social_media_links' limit 1
---
    public function socialMediaView()
    {
        $socialTypes = $this->getSocialTypes();

        // Get the single setting using Query Builder (cached)

            $row = DB::table('business_settings')
                ->where('type', 'social_media_links')
                ->first(['value']);