app/Http/Controllers/Admin/BatchCategoryController.php

select * from `batch_categories` where `batch_categories`.`parent_id` in (1, 2, 3, 4, 5)
---
    public function create() {
        $parents = BatchCategory::active()->whereNull('parent_id')->get();

select * from `batch_categories` where `status` = 1 and `parent_id` is null
---
    public function store(Request $request) {
        // 5.7-এ validation (Rule::in নেই, manual)
        $validator = Validator::make($request->all(), [
            'name' => 'required|string|max:100|unique:batch_categories',
            'slug' => 'required|string|max:100|unique:batch_categories',
            'description' => 'nullable|string',
            'type' => 'required|in:online,offline,hybrid', // in: array
            'parent_id' => 'nullable|exists:batch_categories,id',
            'fee_range' => 'nullable|string|max:50',
            'image' => 'nullable|image|max:2048',
            'status' => 'boolean',
        ]);