app/Http/Controllers/Admin/LocationController.php

select * from `locations` order by `created_at` desc
select * from `business_settings` where `type` = 'locations_section_title' limit 1
---
    public function index()
    {
        $locations = Location::orderBy('created_at', 'desc')->get();
        $sectionTitleRecord = BusinessSetting::where('type', 'locations_section_title')->first();