app/Http/Controllers/Admin/SectionController.php

select * from `home_sections` order by `order_num` asc
---
    public function index()
    {
        $sections = HomeSection::orderBy('order_num')->get();

update `home_sections` set `title` = 'skills', `subtitle` = 'The country’s best skill development platform', `updated_at` = '2025-10-24 21:45:05' where `id` = 9
---
    public function update(Request $request, HomeSection $section)
    {
        $request->validate([
            'title' => 'required|string|max:255',
            'subtitle' => 'nullable|string',
            'section_type' => 'required|string',
            'main_image' => 'nullable|image|max:2048',
            'order_num' => 'required|integer',
            'is_active' => 'boolean'
        ]);

        $data = $request->all();

        if ($request->hasFile('main_image')) {
            if ($section->main_image) {
                Storage::disk('public')->delete($section->main_image);
            }
            $data['main_image'] = $request->file('main_image')->store('images', 'public');
        }

        $section->update($data);

delete from `home_sections` where `id` = 7
---
    public function destroy(HomeSection $section)
    {
        if ($section->main_image) {
            Storage::disk('public')->delete($section->main_image);
        }
        $section->delete();

select * from `mentors`
select * from `memberships`
select * from `batch_categories`
select * from `books`
select * from `problems`
select * from `notices`
---
    public function dataInput(HomeSection $section)
    {
        $mentors = Mentor::all();
        $batches = Membership::all();
        $batch_categories = BatchCategory::all();
        $books = Book::all();
        $problems = Problem::all();

        $notices = \DB::table('notices')->get();